Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/include/pio/pic32cx1025sg61100.h
#define PIN_PA23B_ADC0_X17                         _UL_(23)    
#define MUX_PA23B_ADC0_X17                         _UL_(1)     
#define PINMUX_PA23B_ADC0_X17                      ((PIN_PA23B_ADC0_X17 << 16) | MUX_PA23B_ADC0_X17)
#define PORT_PA23B_ADC0_X17                        (_UL_(1) << 23)

#define PIN_PA27B_ADC0_X18                         _UL_(27)    
#define MUX_PA27B_ADC0_X18                         _UL_(1)     
#define PINMUX_PA27B_ADC0_X18                      ((PIN_PA27B_ADC0_X18 << 16) | MUX_PA27B_ADC0_X18)
#define PORT_PA27B_ADC0_X18                        (_UL_(1) << 27)

#define PIN_PA30B_ADC0_X19                         _UL_(30)    
#define MUX_PA30B_ADC0_X19                         _UL_(1)     
#define PINMUX_PA30B_ADC0_X19                      ((PIN_PA30B_ADC0_X19 << 16) | MUX_PA30B_ADC0_X19)
#define PORT_PA30B_ADC0_X19                        (_UL_(1) << 30)

#define PIN_PB02B_ADC0_X20                         _UL_(34)    
#define MUX_PB02B_ADC0_X20                         _UL_(1)     
#define PINMUX_PB02B_ADC0_X20                      ((PIN_PB02B_ADC0_X20 << 16) | MUX_PB02B_ADC0_X20)
#define PORT_PB02B_ADC0_X20                        (_UL_(1) << 2)

#define PIN_PB03B_ADC0_X21                         _UL_(35)    
#define MUX_PB03B_ADC0_X21                         _UL_(1)     
#define PINMUX_PB03B_ADC0_X21                      ((PIN_PB03B_ADC0_X21 << 16) | MUX_PB03B_ADC0_X21)
#define PORT_PB03B_ADC0_X21                        (_UL_(1) << 3)

#define PIN_PB04B_ADC0_X22                         _UL_(36)    
#define MUX_PB04B_ADC0_X22                         _UL_(1)     
#define PINMUX_PB04B_ADC0_X22                      ((PIN_PB04B_ADC0_X22 << 16) | MUX_PB04B_ADC0_X22)
#define PORT_PB04B_ADC0_X22                        (_UL_(1) << 4)

#define PIN_PB05B_ADC0_X23                         _UL_(37)    
#define MUX_PB05B_ADC0_X23                         _UL_(1)     
#define PINMUX_PB05B_ADC0_X23                      ((PIN_PB05B_ADC0_X23 << 16) | MUX_PB05B_ADC0_X23)
#define PORT_PB05B_ADC0_X23                        (_UL_(1) << 5)

#define PIN_PB06B_ADC0_X24                         _UL_(38)    
#define MUX_PB06B_ADC0_X24                         _UL_(1)     
#define PINMUX_PB06B_ADC0_X24                      ((PIN_PB06B_ADC0_X24 << 16) | MUX_PB06B_ADC0_X24)
#define PORT_PB06B_ADC0_X24                        (_UL_(1) << 6)

#define PIN_PB07B_ADC0_X25                         _UL_(39)    
#define MUX_PB07B_ADC0_X25                         _UL_(1)     
#define PINMUX_PB07B_ADC0_X25                      ((PIN_PB07B_ADC0_X25 << 16) | MUX_PB07B_ADC0_X25)
#define PORT_PB07B_ADC0_X25                        (_UL_(1) << 7)

#define PIN_PB12B_ADC0_X26                         _UL_(44)    
#define MUX_PB12B_ADC0_X26                         _UL_(1)     
#define PINMUX_PB12B_ADC0_X26                      ((PIN_PB12B_ADC0_X26 << 16) | MUX_PB12B_ADC0_X26)
#define PORT_PB12B_ADC0_X26                        (_UL_(1) << 12)

#define PIN_PB13B_ADC0_X27                         _UL_(45)    
#define MUX_PB13B_ADC0_X27                         _UL_(1)     
#define PINMUX_PB13B_ADC0_X27                      ((PIN_PB13B_ADC0_X27 << 16) | MUX_PB13B_ADC0_X27)
#define PORT_PB13B_ADC0_X27                        (_UL_(1) << 13)

#define PIN_PB14B_ADC0_X28                         _UL_(46)    
#define MUX_PB14B_ADC0_X28                         _UL_(1)     
#define PINMUX_PB14B_ADC0_X28                      ((PIN_PB14B_ADC0_X28 << 16) | MUX_PB14B_ADC0_X28)
#define PORT_PB14B_ADC0_X28                        (_UL_(1) << 14)

#define PIN_PB15B_ADC0_X29                         _UL_(47)    
#define MUX_PB15B_ADC0_X29                         _UL_(1)     
#define PINMUX_PB15B_ADC0_X29                      ((PIN_PB15B_ADC0_X29 << 16) | MUX_PB15B_ADC0_X29)
#define PORT_PB15B_ADC0_X29                        (_UL_(1) << 15)

#define PIN_PB00B_ADC0_X30                         _UL_(32)    
#define MUX_PB00B_ADC0_X30                         _UL_(1)     
#define PINMUX_PB00B_ADC0_X30                      ((PIN_PB00B_ADC0_X30 << 16) | MUX_PB00B_ADC0_X30)
#define PORT_PB00B_ADC0_X30                        (_UL_(1) << 0)

#define PIN_PB01B_ADC0_X31                         _UL_(33)    
#define MUX_PB01B_ADC0_X31                         _UL_(1)     
#define PINMUX_PB01B_ADC0_X31                      ((PIN_PB01B_ADC0_X31 << 16) | MUX_PB01B_ADC0_X31)
#define PORT_PB01B_ADC0_X31                        (_UL_(1) << 1)

#define PIN_PA03B_ADC0_Y0                          _UL_(3)     
#define MUX_PA03B_ADC0_Y0                          _UL_(1)     
#define PINMUX_PA03B_ADC0_Y0                       ((PIN_PA03B_ADC0_Y0 << 16) | MUX_PA03B_ADC0_Y0)
#define PORT_PA03B_ADC0_Y0                         (_UL_(1) << 3)

#define PIN_PB08B_ADC0_Y1                          _UL_(40)    
#define MUX_PB08B_ADC0_Y1                          _UL_(1)     
#define PINMUX_PB08B_ADC0_Y1                       ((PIN_PB08B_ADC0_Y1 << 16) | MUX_PB08B_ADC0_Y1)
#define PORT_PB08B_ADC0_Y1                         (_UL_(1) << 8)

#define PIN_PB09B_ADC0_Y2                          _UL_(41)    
#define MUX_PB09B_ADC0_Y2                          _UL_(1)     
#define PINMUX_PB09B_ADC0_Y2                       ((PIN_PB09B_ADC0_Y2 << 16) | MUX_PB09B_ADC0_Y2)
#define PORT_PB09B_ADC0_Y2                         (_UL_(1) << 9)

#define PIN_PA04B_ADC0_Y3                          _UL_(4)     
#define MUX_PA04B_ADC0_Y3                          _UL_(1)     
#define PINMUX_PA04B_ADC0_Y3                       ((PIN_PA04B_ADC0_Y3 << 16) | MUX_PA04B_ADC0_Y3)
#define PORT_PA04B_ADC0_Y3                         (_UL_(1) << 4)

#define PIN_PA06B_ADC0_Y4                          _UL_(6)     
#define MUX_PA06B_ADC0_Y4                          _UL_(1)     
#define PINMUX_PA06B_ADC0_Y4                       ((PIN_PA06B_ADC0_Y4 << 16) | MUX_PA06B_ADC0_Y4)
#define PORT_PA06B_ADC0_Y4                         (_UL_(1) << 6)

#define PIN_PA07B_ADC0_Y5                          _UL_(7)     
#define MUX_PA07B_ADC0_Y5                          _UL_(1)     
#define PINMUX_PA07B_ADC0_Y5                       ((PIN_PA07B_ADC0_Y5 << 16) | MUX_PA07B_ADC0_Y5)
#define PORT_PA07B_ADC0_Y5                         (_UL_(1) << 7)

#define PIN_PA08B_ADC0_Y6                          _UL_(8)     
#define MUX_PA08B_ADC0_Y6                          _UL_(1)     
#define PINMUX_PA08B_ADC0_Y6                       ((PIN_PA08B_ADC0_Y6 << 16) | MUX_PA08B_ADC0_Y6)
#define PORT_PA08B_ADC0_Y6                         (_UL_(1) << 8)

#define PIN_PA09B_ADC0_Y7                          _UL_(9)     
#define MUX_PA09B_ADC0_Y7                          _UL_(1)     
#define PINMUX_PA09B_ADC0_Y7                       ((PIN_PA09B_ADC0_Y7 << 16) | MUX_PA09B_ADC0_Y7)
#define PORT_PA09B_ADC0_Y7                         (_UL_(1) << 9)

