Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/include/pio/pic32cx1025sg61100.h
#define PIN_PA08B_ADC1_AIN2                        _UL_(8)     
#define MUX_PA08B_ADC1_AIN2                        _UL_(1)     
#define PINMUX_PA08B_ADC1_AIN2                     ((PIN_PA08B_ADC1_AIN2 << 16) | MUX_PA08B_ADC1_AIN2)
#define PORT_PA08B_ADC1_AIN2                       (_UL_(1) << 8)

#define PIN_PA09B_ADC1_AIN3                        _UL_(9)     
#define MUX_PA09B_ADC1_AIN3                        _UL_(1)     
#define PINMUX_PA09B_ADC1_AIN3                     ((PIN_PA09B_ADC1_AIN3 << 16) | MUX_PA09B_ADC1_AIN3)
#define PORT_PA09B_ADC1_AIN3                       (_UL_(1) << 9)

#define PIN_PC02B_ADC1_AIN4                        _UL_(66)    
#define MUX_PC02B_ADC1_AIN4                        _UL_(1)     
#define PINMUX_PC02B_ADC1_AIN4                     ((PIN_PC02B_ADC1_AIN4 << 16) | MUX_PC02B_ADC1_AIN4)
#define PORT_PC02B_ADC1_AIN4                       (_UL_(1) << 2)

#define PIN_PC03B_ADC1_AIN5                        _UL_(67)    
#define MUX_PC03B_ADC1_AIN5                        _UL_(1)     
#define PINMUX_PC03B_ADC1_AIN5                     ((PIN_PC03B_ADC1_AIN5 << 16) | MUX_PC03B_ADC1_AIN5)
#define PORT_PC03B_ADC1_AIN5                       (_UL_(1) << 3)

#define PIN_PB04B_ADC1_AIN6                        _UL_(36)    
#define MUX_PB04B_ADC1_AIN6                        _UL_(1)     
#define PINMUX_PB04B_ADC1_AIN6                     ((PIN_PB04B_ADC1_AIN6 << 16) | MUX_PB04B_ADC1_AIN6)
#define PORT_PB04B_ADC1_AIN6                       (_UL_(1) << 4)

#define PIN_PB05B_ADC1_AIN7                        _UL_(37)    
#define MUX_PB05B_ADC1_AIN7                        _UL_(1)     
#define PINMUX_PB05B_ADC1_AIN7                     ((PIN_PB05B_ADC1_AIN7 << 16) | MUX_PB05B_ADC1_AIN7)
#define PORT_PB05B_ADC1_AIN7                       (_UL_(1) << 5)

#define PIN_PB06B_ADC1_AIN8                        _UL_(38)    
#define MUX_PB06B_ADC1_AIN8                        _UL_(1)     
#define PINMUX_PB06B_ADC1_AIN8                     ((PIN_PB06B_ADC1_AIN8 << 16) | MUX_PB06B_ADC1_AIN8)
#define PORT_PB06B_ADC1_AIN8                       (_UL_(1) << 6)

#define PIN_PB07B_ADC1_AIN9                        _UL_(39)    
#define MUX_PB07B_ADC1_AIN9                        _UL_(1)     
#define PINMUX_PB07B_ADC1_AIN9                     ((PIN_PB07B_ADC1_AIN9 << 16) | MUX_PB07B_ADC1_AIN9)
#define PORT_PB07B_ADC1_AIN9                       (_UL_(1) << 7)

#define PIN_PC00B_ADC1_AIN10                       _UL_(64)    
#define MUX_PC00B_ADC1_AIN10                       _UL_(1)     
#define PINMUX_PC00B_ADC1_AIN10                    ((PIN_PC00B_ADC1_AIN10 << 16) | MUX_PC00B_ADC1_AIN10)
#define PORT_PC00B_ADC1_AIN10                      (_UL_(1) << 0)

#define PIN_PC01B_ADC1_AIN11                       _UL_(65)    
#define MUX_PC01B_ADC1_AIN11                       _UL_(1)     
#define PINMUX_PC01B_ADC1_AIN11                    ((PIN_PC01B_ADC1_AIN11 << 16) | MUX_PC01B_ADC1_AIN11)
#define PORT_PC01B_ADC1_AIN11                      (_UL_(1) << 1)

/* ========== PORT definition for CAN0 peripheral ========== */
#define PIN_PA23I_CAN0_RX                          _UL_(23)    
#define MUX_PA23I_CAN0_RX                          _UL_(8)     
#define PINMUX_PA23I_CAN0_RX                       ((PIN_PA23I_CAN0_RX << 16) | MUX_PA23I_CAN0_RX)
#define PORT_PA23I_CAN0_RX                         (_UL_(1) << 23)

#define PIN_PA25I_CAN0_RX                          _UL_(25)    
#define MUX_PA25I_CAN0_RX                          _UL_(8)     
#define PINMUX_PA25I_CAN0_RX                       ((PIN_PA25I_CAN0_RX << 16) | MUX_PA25I_CAN0_RX)
#define PORT_PA25I_CAN0_RX                         (_UL_(1) << 25)

#define PIN_PA22I_CAN0_TX                          _UL_(22)    
#define MUX_PA22I_CAN0_TX                          _UL_(8)     
#define PINMUX_PA22I_CAN0_TX                       ((PIN_PA22I_CAN0_TX << 16) | MUX_PA22I_CAN0_TX)
#define PORT_PA22I_CAN0_TX                         (_UL_(1) << 22)

#define PIN_PA24I_CAN0_TX                          _UL_(24)    
#define MUX_PA24I_CAN0_TX                          _UL_(8)     
#define PINMUX_PA24I_CAN0_TX                       ((PIN_PA24I_CAN0_TX << 16) | MUX_PA24I_CAN0_TX)
#define PORT_PA24I_CAN0_TX                         (_UL_(1) << 24)

/* ========== PORT definition for CAN1 peripheral ========== */
#define PIN_PB13H_CAN1_RX                          _UL_(45)    
#define MUX_PB13H_CAN1_RX                          _UL_(7)     
#define PINMUX_PB13H_CAN1_RX                       ((PIN_PB13H_CAN1_RX << 16) | MUX_PB13H_CAN1_RX)
#define PORT_PB13H_CAN1_RX                         (_UL_(1) << 13)

#define PIN_PB15H_CAN1_RX                          _UL_(47)    
#define MUX_PB15H_CAN1_RX                          _UL_(7)     
#define PINMUX_PB15H_CAN1_RX                       ((PIN_PB15H_CAN1_RX << 16) | MUX_PB15H_CAN1_RX)
#define PORT_PB15H_CAN1_RX                         (_UL_(1) << 15)

#define PIN_PB12H_CAN1_TX                          _UL_(44)    
#define MUX_PB12H_CAN1_TX                          _UL_(7)     
#define PINMUX_PB12H_CAN1_TX                       ((PIN_PB12H_CAN1_TX << 16) | MUX_PB12H_CAN1_TX)
#define PORT_PB12H_CAN1_TX                         (_UL_(1) << 12)

#define PIN_PB14H_CAN1_TX                          _UL_(46)    
#define MUX_PB14H_CAN1_TX                          _UL_(7)     
#define PINMUX_PB14H_CAN1_TX                       ((PIN_PB14H_CAN1_TX << 16) | MUX_PB14H_CAN1_TX)
#define PORT_PB14H_CAN1_TX                         (_UL_(1) << 14)

/* ========== PORT definition for CCL peripheral ========== */
#define PIN_PA04N_CCL_IN0                          _UL_(4)     
#define MUX_PA04N_CCL_IN0                          _UL_(13)    
#define PINMUX_PA04N_CCL_IN0                       ((PIN_PA04N_CCL_IN0 << 16) | MUX_PA04N_CCL_IN0)
#define PORT_PA04N_CCL_IN0                         (_UL_(1) << 4)

#define PIN_PA16N_CCL_IN0                          _UL_(16)    
#define MUX_PA16N_CCL_IN0                          _UL_(13)    
#define PINMUX_PA16N_CCL_IN0                       ((PIN_PA16N_CCL_IN0 << 16) | MUX_PA16N_CCL_IN0)
#define PORT_PA16N_CCL_IN0                         (_UL_(1) << 16)

