Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/include/pio/pic32cx1025sg61100.h
#define PIN_PA18K_PCC_DATA2                        _UL_(18)    
#define MUX_PA18K_PCC_DATA2                        _UL_(10)    
#define PINMUX_PA18K_PCC_DATA2                     ((PIN_PA18K_PCC_DATA2 << 16) | MUX_PA18K_PCC_DATA2)
#define PORT_PA18K_PCC_DATA2                       (_UL_(1) << 18)

#define PIN_PA19K_PCC_DATA3                        _UL_(19)    
#define MUX_PA19K_PCC_DATA3                        _UL_(10)    
#define PINMUX_PA19K_PCC_DATA3                     ((PIN_PA19K_PCC_DATA3 << 16) | MUX_PA19K_PCC_DATA3)
#define PORT_PA19K_PCC_DATA3                       (_UL_(1) << 19)

#define PIN_PA20K_PCC_DATA4                        _UL_(20)    
#define MUX_PA20K_PCC_DATA4                        _UL_(10)    
#define PINMUX_PA20K_PCC_DATA4                     ((PIN_PA20K_PCC_DATA4 << 16) | MUX_PA20K_PCC_DATA4)
#define PORT_PA20K_PCC_DATA4                       (_UL_(1) << 20)

#define PIN_PA21K_PCC_DATA5                        _UL_(21)    
#define MUX_PA21K_PCC_DATA5                        _UL_(10)    
#define PINMUX_PA21K_PCC_DATA5                     ((PIN_PA21K_PCC_DATA5 << 16) | MUX_PA21K_PCC_DATA5)
#define PORT_PA21K_PCC_DATA5                       (_UL_(1) << 21)

#define PIN_PA22K_PCC_DATA6                        _UL_(22)    
#define MUX_PA22K_PCC_DATA6                        _UL_(10)    
#define PINMUX_PA22K_PCC_DATA6                     ((PIN_PA22K_PCC_DATA6 << 16) | MUX_PA22K_PCC_DATA6)
#define PORT_PA22K_PCC_DATA6                       (_UL_(1) << 22)

#define PIN_PA23K_PCC_DATA7                        _UL_(23)    
#define MUX_PA23K_PCC_DATA7                        _UL_(10)    
#define PINMUX_PA23K_PCC_DATA7                     ((PIN_PA23K_PCC_DATA7 << 16) | MUX_PA23K_PCC_DATA7)
#define PORT_PA23K_PCC_DATA7                       (_UL_(1) << 23)

#define PIN_PB14K_PCC_DATA8                        _UL_(46)    
#define MUX_PB14K_PCC_DATA8                        _UL_(10)    
#define PINMUX_PB14K_PCC_DATA8                     ((PIN_PB14K_PCC_DATA8 << 16) | MUX_PB14K_PCC_DATA8)
#define PORT_PB14K_PCC_DATA8                       (_UL_(1) << 14)

#define PIN_PB15K_PCC_DATA9                        _UL_(47)    
#define MUX_PB15K_PCC_DATA9                        _UL_(10)    
#define PINMUX_PB15K_PCC_DATA9                     ((PIN_PB15K_PCC_DATA9 << 16) | MUX_PB15K_PCC_DATA9)
#define PORT_PB15K_PCC_DATA9                       (_UL_(1) << 15)

#define PIN_PC12K_PCC_DATA10                       _UL_(76)    
#define MUX_PC12K_PCC_DATA10                       _UL_(10)    
#define PINMUX_PC12K_PCC_DATA10                    ((PIN_PC12K_PCC_DATA10 << 16) | MUX_PC12K_PCC_DATA10)
#define PORT_PC12K_PCC_DATA10                      (_UL_(1) << 12)

#define PIN_PC13K_PCC_DATA11                       _UL_(77)    
#define MUX_PC13K_PCC_DATA11                       _UL_(10)    
#define PINMUX_PC13K_PCC_DATA11                    ((PIN_PC13K_PCC_DATA11 << 16) | MUX_PC13K_PCC_DATA11)
#define PORT_PC13K_PCC_DATA11                      (_UL_(1) << 13)

#define PIN_PC14K_PCC_DATA12                       _UL_(78)    
#define MUX_PC14K_PCC_DATA12                       _UL_(10)    
#define PINMUX_PC14K_PCC_DATA12                    ((PIN_PC14K_PCC_DATA12 << 16) | MUX_PC14K_PCC_DATA12)
#define PORT_PC14K_PCC_DATA12                      (_UL_(1) << 14)

#define PIN_PC15K_PCC_DATA13                       _UL_(79)    
#define MUX_PC15K_PCC_DATA13                       _UL_(10)    
#define PINMUX_PC15K_PCC_DATA13                    ((PIN_PC15K_PCC_DATA13 << 16) | MUX_PC15K_PCC_DATA13)
#define PORT_PC15K_PCC_DATA13                      (_UL_(1) << 15)

#define PIN_PA12K_PCC_DEN1                         _UL_(12)    
#define MUX_PA12K_PCC_DEN1                         _UL_(10)    
#define PINMUX_PA12K_PCC_DEN1                      ((PIN_PA12K_PCC_DEN1 << 16) | MUX_PA12K_PCC_DEN1)
#define PORT_PA12K_PCC_DEN1                        (_UL_(1) << 12)

#define PIN_PA13K_PCC_DEN2                         _UL_(13)    
#define MUX_PA13K_PCC_DEN2                         _UL_(10)    
#define PINMUX_PA13K_PCC_DEN2                      ((PIN_PA13K_PCC_DEN2 << 16) | MUX_PA13K_PCC_DEN2)
#define PORT_PA13K_PCC_DEN2                        (_UL_(1) << 13)

/* ========== PORT definition for PDEC peripheral ========== */
#define PIN_PB18G_PDEC_QDI0                        _UL_(50)    
#define MUX_PB18G_PDEC_QDI0                        _UL_(6)     
#define PINMUX_PB18G_PDEC_QDI0                     ((PIN_PB18G_PDEC_QDI0 << 16) | MUX_PB18G_PDEC_QDI0)
#define PORT_PB18G_PDEC_QDI0                       (_UL_(1) << 18)

#define PIN_PB23G_PDEC_QDI0                        _UL_(55)    
#define MUX_PB23G_PDEC_QDI0                        _UL_(6)     
#define PINMUX_PB23G_PDEC_QDI0                     ((PIN_PB23G_PDEC_QDI0 << 16) | MUX_PB23G_PDEC_QDI0)
#define PORT_PB23G_PDEC_QDI0                       (_UL_(1) << 23)

#define PIN_PC16G_PDEC_QDI0                        _UL_(80)    
#define MUX_PC16G_PDEC_QDI0                        _UL_(6)     
#define PINMUX_PC16G_PDEC_QDI0                     ((PIN_PC16G_PDEC_QDI0 << 16) | MUX_PC16G_PDEC_QDI0)
#define PORT_PC16G_PDEC_QDI0                       (_UL_(1) << 16)

#define PIN_PA24G_PDEC_QDI0                        _UL_(24)    
#define MUX_PA24G_PDEC_QDI0                        _UL_(6)     
#define PINMUX_PA24G_PDEC_QDI0                     ((PIN_PA24G_PDEC_QDI0 << 16) | MUX_PA24G_PDEC_QDI0)
#define PORT_PA24G_PDEC_QDI0                       (_UL_(1) << 24)

#define PIN_PB19G_PDEC_QDI1                        _UL_(51)    
#define MUX_PB19G_PDEC_QDI1                        _UL_(6)     
#define PINMUX_PB19G_PDEC_QDI1                     ((PIN_PB19G_PDEC_QDI1 << 16) | MUX_PB19G_PDEC_QDI1)
#define PORT_PB19G_PDEC_QDI1                       (_UL_(1) << 19)

#define PIN_PB24G_PDEC_QDI1                        _UL_(56)    
#define MUX_PB24G_PDEC_QDI1                        _UL_(6)     
#define PINMUX_PB24G_PDEC_QDI1                     ((PIN_PB24G_PDEC_QDI1 << 16) | MUX_PB24G_PDEC_QDI1)
#define PORT_PB24G_PDEC_QDI1                       (_UL_(1) << 24)

#define PIN_PC17G_PDEC_QDI1                        _UL_(81)    
#define MUX_PC17G_PDEC_QDI1                        _UL_(6)     
#define PINMUX_PC17G_PDEC_QDI1                     ((PIN_PC17G_PDEC_QDI1 << 16) | MUX_PC17G_PDEC_QDI1)
#define PORT_PC17G_PDEC_QDI1                       (_UL_(1) << 17)

