Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/include/pio/pic32cx1025sg61100.h
#define PIN_PC05C_SERCOM6_PAD1                     _UL_(69)    
#define MUX_PC05C_SERCOM6_PAD1                     _UL_(2)     
#define PINMUX_PC05C_SERCOM6_PAD1                  ((PIN_PC05C_SERCOM6_PAD1 << 16) | MUX_PC05C_SERCOM6_PAD1)
#define PORT_PC05C_SERCOM6_PAD1                    (_UL_(1) << 5)

#define PIN_PC17C_SERCOM6_PAD1                     _UL_(81)    
#define MUX_PC17C_SERCOM6_PAD1                     _UL_(2)     
#define PINMUX_PC17C_SERCOM6_PAD1                  ((PIN_PC17C_SERCOM6_PAD1 << 16) | MUX_PC17C_SERCOM6_PAD1)
#define PORT_PC17C_SERCOM6_PAD1                    (_UL_(1) << 17)

#define PIN_PC14D_SERCOM6_PAD2                     _UL_(78)    
#define MUX_PC14D_SERCOM6_PAD2                     _UL_(3)     
#define PINMUX_PC14D_SERCOM6_PAD2                  ((PIN_PC14D_SERCOM6_PAD2 << 16) | MUX_PC14D_SERCOM6_PAD2)
#define PORT_PC14D_SERCOM6_PAD2                    (_UL_(1) << 14)

#define PIN_PC06C_SERCOM6_PAD2                     _UL_(70)    
#define MUX_PC06C_SERCOM6_PAD2                     _UL_(2)     
#define PINMUX_PC06C_SERCOM6_PAD2                  ((PIN_PC06C_SERCOM6_PAD2 << 16) | MUX_PC06C_SERCOM6_PAD2)
#define PORT_PC06C_SERCOM6_PAD2                    (_UL_(1) << 6)

#define PIN_PC10C_SERCOM6_PAD2                     _UL_(74)    
#define MUX_PC10C_SERCOM6_PAD2                     _UL_(2)     
#define PINMUX_PC10C_SERCOM6_PAD2                  ((PIN_PC10C_SERCOM6_PAD2 << 16) | MUX_PC10C_SERCOM6_PAD2)
#define PORT_PC10C_SERCOM6_PAD2                    (_UL_(1) << 10)

#define PIN_PC18C_SERCOM6_PAD2                     _UL_(82)    
#define MUX_PC18C_SERCOM6_PAD2                     _UL_(2)     
#define PINMUX_PC18C_SERCOM6_PAD2                  ((PIN_PC18C_SERCOM6_PAD2 << 16) | MUX_PC18C_SERCOM6_PAD2)
#define PORT_PC18C_SERCOM6_PAD2                    (_UL_(1) << 18)

#define PIN_PC15D_SERCOM6_PAD3                     _UL_(79)    
#define MUX_PC15D_SERCOM6_PAD3                     _UL_(3)     
#define PINMUX_PC15D_SERCOM6_PAD3                  ((PIN_PC15D_SERCOM6_PAD3 << 16) | MUX_PC15D_SERCOM6_PAD3)
#define PORT_PC15D_SERCOM6_PAD3                    (_UL_(1) << 15)

#define PIN_PC07C_SERCOM6_PAD3                     _UL_(71)    
#define MUX_PC07C_SERCOM6_PAD3                     _UL_(2)     
#define PINMUX_PC07C_SERCOM6_PAD3                  ((PIN_PC07C_SERCOM6_PAD3 << 16) | MUX_PC07C_SERCOM6_PAD3)
#define PORT_PC07C_SERCOM6_PAD3                    (_UL_(1) << 7)

#define PIN_PC11C_SERCOM6_PAD3                     _UL_(75)    
#define MUX_PC11C_SERCOM6_PAD3                     _UL_(2)     
#define PINMUX_PC11C_SERCOM6_PAD3                  ((PIN_PC11C_SERCOM6_PAD3 << 16) | MUX_PC11C_SERCOM6_PAD3)
#define PORT_PC11C_SERCOM6_PAD3                    (_UL_(1) << 11)

#define PIN_PC19C_SERCOM6_PAD3                     _UL_(83)    
#define MUX_PC19C_SERCOM6_PAD3                     _UL_(2)     
#define PINMUX_PC19C_SERCOM6_PAD3                  ((PIN_PC19C_SERCOM6_PAD3 << 16) | MUX_PC19C_SERCOM6_PAD3)
#define PORT_PC19C_SERCOM6_PAD3                    (_UL_(1) << 19)

/* ========== PORT definition for SERCOM7 peripheral ========== */
#define PIN_PB21D_SERCOM7_PAD0                     _UL_(53)    
#define MUX_PB21D_SERCOM7_PAD0                     _UL_(3)     
#define PINMUX_PB21D_SERCOM7_PAD0                  ((PIN_PB21D_SERCOM7_PAD0 << 16) | MUX_PB21D_SERCOM7_PAD0)
#define PORT_PB21D_SERCOM7_PAD0                    (_UL_(1) << 21)

#define PIN_PB30C_SERCOM7_PAD0                     _UL_(62)    
#define MUX_PB30C_SERCOM7_PAD0                     _UL_(2)     
#define PINMUX_PB30C_SERCOM7_PAD0                  ((PIN_PB30C_SERCOM7_PAD0 << 16) | MUX_PB30C_SERCOM7_PAD0)
#define PORT_PB30C_SERCOM7_PAD0                    (_UL_(1) << 30)

#define PIN_PC12C_SERCOM7_PAD0                     _UL_(76)    
#define MUX_PC12C_SERCOM7_PAD0                     _UL_(2)     
#define PINMUX_PC12C_SERCOM7_PAD0                  ((PIN_PC12C_SERCOM7_PAD0 << 16) | MUX_PC12C_SERCOM7_PAD0)
#define PORT_PC12C_SERCOM7_PAD0                    (_UL_(1) << 12)

#define PIN_PB20D_SERCOM7_PAD1                     _UL_(52)    
#define MUX_PB20D_SERCOM7_PAD1                     _UL_(3)     
#define PINMUX_PB20D_SERCOM7_PAD1                  ((PIN_PB20D_SERCOM7_PAD1 << 16) | MUX_PB20D_SERCOM7_PAD1)
#define PORT_PB20D_SERCOM7_PAD1                    (_UL_(1) << 20)

#define PIN_PB31C_SERCOM7_PAD1                     _UL_(63)    
#define MUX_PB31C_SERCOM7_PAD1                     _UL_(2)     
#define PINMUX_PB31C_SERCOM7_PAD1                  ((PIN_PB31C_SERCOM7_PAD1 << 16) | MUX_PB31C_SERCOM7_PAD1)
#define PORT_PB31C_SERCOM7_PAD1                    (_UL_(1) << 31)

#define PIN_PC13C_SERCOM7_PAD1                     _UL_(77)    
#define MUX_PC13C_SERCOM7_PAD1                     _UL_(2)     
#define PINMUX_PC13C_SERCOM7_PAD1                  ((PIN_PC13C_SERCOM7_PAD1 << 16) | MUX_PC13C_SERCOM7_PAD1)
#define PORT_PC13C_SERCOM7_PAD1                    (_UL_(1) << 13)

#define PIN_PB18D_SERCOM7_PAD2                     _UL_(50)    
#define MUX_PB18D_SERCOM7_PAD2                     _UL_(3)     
#define PINMUX_PB18D_SERCOM7_PAD2                  ((PIN_PB18D_SERCOM7_PAD2 << 16) | MUX_PB18D_SERCOM7_PAD2)
#define PORT_PB18D_SERCOM7_PAD2                    (_UL_(1) << 18)

#define PIN_PC10D_SERCOM7_PAD2                     _UL_(74)    
#define MUX_PC10D_SERCOM7_PAD2                     _UL_(3)     
#define PINMUX_PC10D_SERCOM7_PAD2                  ((PIN_PC10D_SERCOM7_PAD2 << 16) | MUX_PC10D_SERCOM7_PAD2)
#define PORT_PC10D_SERCOM7_PAD2                    (_UL_(1) << 10)

#define PIN_PC14C_SERCOM7_PAD2                     _UL_(78)    
#define MUX_PC14C_SERCOM7_PAD2                     _UL_(2)     
#define PINMUX_PC14C_SERCOM7_PAD2                  ((PIN_PC14C_SERCOM7_PAD2 << 16) | MUX_PC14C_SERCOM7_PAD2)
#define PORT_PC14C_SERCOM7_PAD2                    (_UL_(1) << 14)

#define PIN_PA30C_SERCOM7_PAD2                     _UL_(30)    
#define MUX_PA30C_SERCOM7_PAD2                     _UL_(2)     
#define PINMUX_PA30C_SERCOM7_PAD2                  ((PIN_PA30C_SERCOM7_PAD2 << 16) | MUX_PA30C_SERCOM7_PAD2)
#define PORT_PA30C_SERCOM7_PAD2                    (_UL_(1) << 30)

#define PIN_PB19D_SERCOM7_PAD3                     _UL_(51)    
#define MUX_PB19D_SERCOM7_PAD3                     _UL_(3)     
#define PINMUX_PB19D_SERCOM7_PAD3                  ((PIN_PB19D_SERCOM7_PAD3 << 16) | MUX_PB19D_SERCOM7_PAD3)
#define PORT_PB19D_SERCOM7_PAD3                    (_UL_(1) << 19)

#define PIN_PC11D_SERCOM7_PAD3                     _UL_(75)    
#define MUX_PC11D_SERCOM7_PAD3                     _UL_(3)     
#define PINMUX_PC11D_SERCOM7_PAD3                  ((PIN_PC11D_SERCOM7_PAD3 << 16) | MUX_PC11D_SERCOM7_PAD3)
#define PORT_PC11D_SERCOM7_PAD3                    (_UL_(1) << 11)

#define PIN_PC15C_SERCOM7_PAD3                     _UL_(79)    
#define MUX_PC15C_SERCOM7_PAD3                     _UL_(2)     
#define PINMUX_PC15C_SERCOM7_PAD3                  ((PIN_PC15C_SERCOM7_PAD3 << 16) | MUX_PC15C_SERCOM7_PAD3)
#define PORT_PC15C_SERCOM7_PAD3                    (_UL_(1) << 15)

