Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/include/pio/pic32cx1025sg61100.h
#define PIN_PB14G_TCC0_WO2                         _UL_(46)    
#define MUX_PB14G_TCC0_WO2                         _UL_(6)     
#define PINMUX_PB14G_TCC0_WO2                      ((PIN_PB14G_TCC0_WO2 << 16) | MUX_PB14G_TCC0_WO2)
#define PORT_PB14G_TCC0_WO2                        (_UL_(1) << 14)

#define PIN_PA10F_TCC0_WO2                         _UL_(10)    
#define MUX_PA10F_TCC0_WO2                         _UL_(5)     
#define PINMUX_PA10F_TCC0_WO2                      ((PIN_PA10F_TCC0_WO2 << 16) | MUX_PA10F_TCC0_WO2)
#define PORT_PA10F_TCC0_WO2                        (_UL_(1) << 10)

#define PIN_PC12F_TCC0_WO2                         _UL_(76)    
#define MUX_PC12F_TCC0_WO2                         _UL_(5)     
#define PINMUX_PC12F_TCC0_WO2                      ((PIN_PC12F_TCC0_WO2 << 16) | MUX_PC12F_TCC0_WO2)
#define PORT_PC12F_TCC0_WO2                        (_UL_(1) << 12)

#define PIN_PC18F_TCC0_WO2                         _UL_(82)    
#define MUX_PC18F_TCC0_WO2                         _UL_(5)     
#define PINMUX_PC18F_TCC0_WO2                      ((PIN_PC18F_TCC0_WO2 << 16) | MUX_PC18F_TCC0_WO2)
#define PORT_PC18F_TCC0_WO2                        (_UL_(1) << 18)

#define PIN_PA23G_TCC0_WO3                         _UL_(23)    
#define MUX_PA23G_TCC0_WO3                         _UL_(6)     
#define PINMUX_PA23G_TCC0_WO3                      ((PIN_PA23G_TCC0_WO3 << 16) | MUX_PA23G_TCC0_WO3)
#define PORT_PA23G_TCC0_WO3                        (_UL_(1) << 23)

#define PIN_PB15G_TCC0_WO3                         _UL_(47)    
#define MUX_PB15G_TCC0_WO3                         _UL_(6)     
#define PINMUX_PB15G_TCC0_WO3                      ((PIN_PB15G_TCC0_WO3 << 16) | MUX_PB15G_TCC0_WO3)
#define PORT_PB15G_TCC0_WO3                        (_UL_(1) << 15)

#define PIN_PA11F_TCC0_WO3                         _UL_(11)    
#define MUX_PA11F_TCC0_WO3                         _UL_(5)     
#define PINMUX_PA11F_TCC0_WO3                      ((PIN_PA11F_TCC0_WO3 << 16) | MUX_PA11F_TCC0_WO3)
#define PORT_PA11F_TCC0_WO3                        (_UL_(1) << 11)

#define PIN_PC13F_TCC0_WO3                         _UL_(77)    
#define MUX_PC13F_TCC0_WO3                         _UL_(5)     
#define PINMUX_PC13F_TCC0_WO3                      ((PIN_PC13F_TCC0_WO3 << 16) | MUX_PC13F_TCC0_WO3)
#define PORT_PC13F_TCC0_WO3                        (_UL_(1) << 13)

#define PIN_PC19F_TCC0_WO3                         _UL_(83)    
#define MUX_PC19F_TCC0_WO3                         _UL_(5)     
#define PINMUX_PC19F_TCC0_WO3                      ((PIN_PC19F_TCC0_WO3 << 16) | MUX_PC19F_TCC0_WO3)
#define PORT_PC19F_TCC0_WO3                        (_UL_(1) << 19)

#define PIN_PA16G_TCC0_WO4                         _UL_(16)    
#define MUX_PA16G_TCC0_WO4                         _UL_(6)     
#define PINMUX_PA16G_TCC0_WO4                      ((PIN_PA16G_TCC0_WO4 << 16) | MUX_PA16G_TCC0_WO4)
#define PORT_PA16G_TCC0_WO4                        (_UL_(1) << 16)

#define PIN_PB16G_TCC0_WO4                         _UL_(48)    
#define MUX_PB16G_TCC0_WO4                         _UL_(6)     
#define PINMUX_PB16G_TCC0_WO4                      ((PIN_PB16G_TCC0_WO4 << 16) | MUX_PB16G_TCC0_WO4)
#define PORT_PB16G_TCC0_WO4                        (_UL_(1) << 16)

#define PIN_PB10F_TCC0_WO4                         _UL_(42)    
#define MUX_PB10F_TCC0_WO4                         _UL_(5)     
#define PINMUX_PB10F_TCC0_WO4                      ((PIN_PB10F_TCC0_WO4 << 16) | MUX_PB10F_TCC0_WO4)
#define PORT_PB10F_TCC0_WO4                        (_UL_(1) << 10)

#define PIN_PC14F_TCC0_WO4                         _UL_(78)    
#define MUX_PC14F_TCC0_WO4                         _UL_(5)     
#define PINMUX_PC14F_TCC0_WO4                      ((PIN_PC14F_TCC0_WO4 << 16) | MUX_PC14F_TCC0_WO4)
#define PORT_PC14F_TCC0_WO4                        (_UL_(1) << 14)

#define PIN_PC20F_TCC0_WO4                         _UL_(84)    
#define MUX_PC20F_TCC0_WO4                         _UL_(5)     
#define PINMUX_PC20F_TCC0_WO4                      ((PIN_PC20F_TCC0_WO4 << 16) | MUX_PC20F_TCC0_WO4)
#define PORT_PC20F_TCC0_WO4                        (_UL_(1) << 20)

#define PIN_PA17G_TCC0_WO5                         _UL_(17)    
#define MUX_PA17G_TCC0_WO5                         _UL_(6)     
#define PINMUX_PA17G_TCC0_WO5                      ((PIN_PA17G_TCC0_WO5 << 16) | MUX_PA17G_TCC0_WO5)
#define PORT_PA17G_TCC0_WO5                        (_UL_(1) << 17)

#define PIN_PB17G_TCC0_WO5                         _UL_(49)    
#define MUX_PB17G_TCC0_WO5                         _UL_(6)     
#define PINMUX_PB17G_TCC0_WO5                      ((PIN_PB17G_TCC0_WO5 << 16) | MUX_PB17G_TCC0_WO5)
#define PORT_PB17G_TCC0_WO5                        (_UL_(1) << 17)

#define PIN_PB11F_TCC0_WO5                         _UL_(43)    
#define MUX_PB11F_TCC0_WO5                         _UL_(5)     
#define PINMUX_PB11F_TCC0_WO5                      ((PIN_PB11F_TCC0_WO5 << 16) | MUX_PB11F_TCC0_WO5)
#define PORT_PB11F_TCC0_WO5                        (_UL_(1) << 11)

#define PIN_PC15F_TCC0_WO5                         _UL_(79)    
#define MUX_PC15F_TCC0_WO5                         _UL_(5)     
#define PINMUX_PC15F_TCC0_WO5                      ((PIN_PC15F_TCC0_WO5 << 16) | MUX_PC15F_TCC0_WO5)
#define PORT_PC15F_TCC0_WO5                        (_UL_(1) << 15)

#define PIN_PC21F_TCC0_WO5                         _UL_(85)    
#define MUX_PC21F_TCC0_WO5                         _UL_(5)     
#define PINMUX_PC21F_TCC0_WO5                      ((PIN_PC21F_TCC0_WO5 << 16) | MUX_PC21F_TCC0_WO5)
#define PORT_PC21F_TCC0_WO5                        (_UL_(1) << 21)

#define PIN_PA18G_TCC0_WO6                         _UL_(18)    
#define MUX_PA18G_TCC0_WO6                         _UL_(6)     
#define PINMUX_PA18G_TCC0_WO6                      ((PIN_PA18G_TCC0_WO6 << 16) | MUX_PA18G_TCC0_WO6)
#define PORT_PA18G_TCC0_WO6                        (_UL_(1) << 18)

#define PIN_PB30G_TCC0_WO6                         _UL_(62)    
#define MUX_PB30G_TCC0_WO6                         _UL_(6)     
#define PINMUX_PB30G_TCC0_WO6                      ((PIN_PB30G_TCC0_WO6 << 16) | MUX_PB30G_TCC0_WO6)
#define PORT_PB30G_TCC0_WO6                        (_UL_(1) << 30)

#define PIN_PA12F_TCC0_WO6                         _UL_(12)    
#define MUX_PA12F_TCC0_WO6                         _UL_(5)     
#define PINMUX_PA12F_TCC0_WO6                      ((PIN_PA12F_TCC0_WO6 << 16) | MUX_PA12F_TCC0_WO6)
#define PORT_PA12F_TCC0_WO6                        (_UL_(1) << 12)

