Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/include/pio/pic32cx1025sg61100.h
#define PIN_PA21F_TCC1_WO5                         _UL_(21)    
#define MUX_PA21F_TCC1_WO5                         _UL_(5)     
#define PINMUX_PA21F_TCC1_WO5                      ((PIN_PA21F_TCC1_WO5 << 16) | MUX_PA21F_TCC1_WO5)
#define PORT_PA21F_TCC1_WO5                        (_UL_(1) << 21)

#define PIN_PA10G_TCC1_WO6                         _UL_(10)    
#define MUX_PA10G_TCC1_WO6                         _UL_(6)     
#define PINMUX_PA10G_TCC1_WO6                      ((PIN_PA10G_TCC1_WO6 << 16) | MUX_PA10G_TCC1_WO6)
#define PORT_PA10G_TCC1_WO6                        (_UL_(1) << 10)

#define PIN_PC12G_TCC1_WO6                         _UL_(76)    
#define MUX_PC12G_TCC1_WO6                         _UL_(6)     
#define PINMUX_PC12G_TCC1_WO6                      ((PIN_PC12G_TCC1_WO6 << 16) | MUX_PC12G_TCC1_WO6)
#define PORT_PC12G_TCC1_WO6                        (_UL_(1) << 12)

#define PIN_PA22F_TCC1_WO6                         _UL_(22)    
#define MUX_PA22F_TCC1_WO6                         _UL_(5)     
#define PINMUX_PA22F_TCC1_WO6                      ((PIN_PA22F_TCC1_WO6 << 16) | MUX_PA22F_TCC1_WO6)
#define PORT_PA22F_TCC1_WO6                        (_UL_(1) << 22)

#define PIN_PA11G_TCC1_WO7                         _UL_(11)    
#define MUX_PA11G_TCC1_WO7                         _UL_(6)     
#define PINMUX_PA11G_TCC1_WO7                      ((PIN_PA11G_TCC1_WO7 << 16) | MUX_PA11G_TCC1_WO7)
#define PORT_PA11G_TCC1_WO7                        (_UL_(1) << 11)

#define PIN_PC13G_TCC1_WO7                         _UL_(77)    
#define MUX_PC13G_TCC1_WO7                         _UL_(6)     
#define PINMUX_PC13G_TCC1_WO7                      ((PIN_PC13G_TCC1_WO7 << 16) | MUX_PC13G_TCC1_WO7)
#define PORT_PC13G_TCC1_WO7                        (_UL_(1) << 13)

#define PIN_PA23F_TCC1_WO7                         _UL_(23)    
#define MUX_PA23F_TCC1_WO7                         _UL_(5)     
#define PINMUX_PA23F_TCC1_WO7                      ((PIN_PA23F_TCC1_WO7 << 16) | MUX_PA23F_TCC1_WO7)
#define PORT_PA23F_TCC1_WO7                        (_UL_(1) << 23)

/* ========== PORT definition for TCC2 peripheral ========== */
#define PIN_PA14F_TCC2_WO0                         _UL_(14)    
#define MUX_PA14F_TCC2_WO0                         _UL_(5)     
#define PINMUX_PA14F_TCC2_WO0                      ((PIN_PA14F_TCC2_WO0 << 16) | MUX_PA14F_TCC2_WO0)
#define PORT_PA14F_TCC2_WO0                        (_UL_(1) << 14)

#define PIN_PA30F_TCC2_WO0                         _UL_(30)    
#define MUX_PA30F_TCC2_WO0                         _UL_(5)     
#define PINMUX_PA30F_TCC2_WO0                      ((PIN_PA30F_TCC2_WO0 << 16) | MUX_PA30F_TCC2_WO0)
#define PORT_PA30F_TCC2_WO0                        (_UL_(1) << 30)

#define PIN_PA15F_TCC2_WO1                         _UL_(15)    
#define MUX_PA15F_TCC2_WO1                         _UL_(5)     
#define PINMUX_PA15F_TCC2_WO1                      ((PIN_PA15F_TCC2_WO1 << 16) | MUX_PA15F_TCC2_WO1)
#define PORT_PA15F_TCC2_WO1                        (_UL_(1) << 15)

#define PIN_PA31F_TCC2_WO1                         _UL_(31)    
#define MUX_PA31F_TCC2_WO1                         _UL_(5)     
#define PINMUX_PA31F_TCC2_WO1                      ((PIN_PA31F_TCC2_WO1 << 16) | MUX_PA31F_TCC2_WO1)
#define PORT_PA31F_TCC2_WO1                        (_UL_(1) << 31)

#define PIN_PA24F_TCC2_WO2                         _UL_(24)    
#define MUX_PA24F_TCC2_WO2                         _UL_(5)     
#define PINMUX_PA24F_TCC2_WO2                      ((PIN_PA24F_TCC2_WO2 << 16) | MUX_PA24F_TCC2_WO2)
#define PORT_PA24F_TCC2_WO2                        (_UL_(1) << 24)

#define PIN_PB02F_TCC2_WO2                         _UL_(34)    
#define MUX_PB02F_TCC2_WO2                         _UL_(5)     
#define PINMUX_PB02F_TCC2_WO2                      ((PIN_PB02F_TCC2_WO2 << 16) | MUX_PB02F_TCC2_WO2)
#define PORT_PB02F_TCC2_WO2                        (_UL_(1) << 2)

/* ========== PORT definition for TCC3 peripheral ========== */
#define PIN_PB12F_TCC3_WO0                         _UL_(44)    
#define MUX_PB12F_TCC3_WO0                         _UL_(5)     
#define PINMUX_PB12F_TCC3_WO0                      ((PIN_PB12F_TCC3_WO0 << 16) | MUX_PB12F_TCC3_WO0)
#define PORT_PB12F_TCC3_WO0                        (_UL_(1) << 12)

#define PIN_PB16F_TCC3_WO0                         _UL_(48)    
#define MUX_PB16F_TCC3_WO0                         _UL_(5)     
#define PINMUX_PB16F_TCC3_WO0                      ((PIN_PB16F_TCC3_WO0 << 16) | MUX_PB16F_TCC3_WO0)
#define PORT_PB16F_TCC3_WO0                        (_UL_(1) << 16)

#define PIN_PB13F_TCC3_WO1                         _UL_(45)    
#define MUX_PB13F_TCC3_WO1                         _UL_(5)     
#define PINMUX_PB13F_TCC3_WO1                      ((PIN_PB13F_TCC3_WO1 << 16) | MUX_PB13F_TCC3_WO1)
#define PORT_PB13F_TCC3_WO1                        (_UL_(1) << 13)

#define PIN_PB17F_TCC3_WO1                         _UL_(49)    
#define MUX_PB17F_TCC3_WO1                         _UL_(5)     
#define PINMUX_PB17F_TCC3_WO1                      ((PIN_PB17F_TCC3_WO1 << 16) | MUX_PB17F_TCC3_WO1)
#define PORT_PB17F_TCC3_WO1                        (_UL_(1) << 17)

/* ========== PORT definition for TCC4 peripheral ========== */
#define PIN_PB14F_TCC4_WO0                         _UL_(46)    
#define MUX_PB14F_TCC4_WO0                         _UL_(5)     
#define PINMUX_PB14F_TCC4_WO0                      ((PIN_PB14F_TCC4_WO0 << 16) | MUX_PB14F_TCC4_WO0)
#define PORT_PB14F_TCC4_WO0                        (_UL_(1) << 14)

#define PIN_PB30F_TCC4_WO0                         _UL_(62)    
#define MUX_PB30F_TCC4_WO0                         _UL_(5)     
#define PINMUX_PB30F_TCC4_WO0                      ((PIN_PB30F_TCC4_WO0 << 16) | MUX_PB30F_TCC4_WO0)
#define PORT_PB30F_TCC4_WO0                        (_UL_(1) << 30)

#define PIN_PB15F_TCC4_WO1                         _UL_(47)    
#define MUX_PB15F_TCC4_WO1                         _UL_(5)     
#define PINMUX_PB15F_TCC4_WO1                      ((PIN_PB15F_TCC4_WO1 << 16) | MUX_PB15F_TCC4_WO1)
#define PORT_PB15F_TCC4_WO1                        (_UL_(1) << 15)

#define PIN_PB31F_TCC4_WO1                         _UL_(63)    
#define MUX_PB31F_TCC4_WO1                         _UL_(5)     
#define PINMUX_PB31F_TCC4_WO1                      ((PIN_PB31F_TCC4_WO1 << 16) | MUX_PB31F_TCC4_WO1)
#define PORT_PB31F_TCC4_WO1                        (_UL_(1) << 31)

